deadlines.org
#+title: Deadlines
* DONE Get project group
CLOSED: [2020-09-08 Tue 18:21] DEADLINE: <2020-09-09 Wed>
Group: L3-T-2
Members:
 - Morgan Smith
 - Samuel Dewan
 - Mario Shebib
 - Sunjeevani Pujari
* DONE Team Contract Submission
CLOSED: [2020-09-19 Sat 15:32] DEADLINE: <2020-09-20 Sun>
* DONE Approval of project concept
CLOSED: [2020-09-22 Tue 13:57] DEADLINE: <2020-09-23 Wed>
* TODO Proposal Draft
DEADLINE: <2020-09-29 Tue 23:59>
* TODO Proposal Peer-Review (during class)
SCHEDULED: <2020-09-30 Wed 11:35-13:25>
* TODO Proposal Peer-Review feedback reflection
DEADLINE: <2020-10-02 Fri 20:00>
Opens <2020-10-01 Thu 12:00>
* TODO Final Submission of Project Proposal (On CULearn)
DEADLINE: <2020-10-02 Fri 20:00>
* TODO Individual Lab Exam (To be scheduled collaboratively with TAs)
DEADLINE: <2020-10-05 Mon>
* TODO Synchronous Design Peer Review (Mandatory)
DEADLINE: <2020-10-21 Wed>
* TODO Final Submission of Project Design (On CULearn)
DEADLINE: <2020-10-23 Fri 20:00>
* TODO Lab Check-in (End-to-End Demo) (To be scheduled collaboratively with TAs)
DEADLINE: <2020-11-04 Wed>
* TODO Lab Check-in (Testing Demo) (To be scheduled collaboratively with TAs)
DEADLINE: <2020-11-18 Wed>
* TODO Submission of Technical Memo
DEADLINE: <2020-11-22 Sun 20:00>
* TODO Synchronous Code Peer Review (Mandatory)
DEADLINE: <2020-11-25 Wed>
* TODO Final Demo of Project (To be scheduled collaboratively with TAs)
DEADLINE: <2020-12-02 Wed>
* TODO Final Project Report/Video with Synchronous Poster Fair
DEADLINE: <2020-12-09 Wed 11:30>
