html/deadlines.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-27 Sun 20:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Deadlines</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Deadlines</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org08b0850">1. <span class="done DONE">DONE</span> Get project group</a></li>
<li><a href="#org0c01f24">2. <span class="done DONE">DONE</span> Team Contract Submission</a></li>
<li><a href="#orgf57a3a8">3. <span class="done DONE">DONE</span> Approval of project concept</a></li>
<li><a href="#org2f2b192">4. <span class="todo TODO">TODO</span> Proposal Draft</a></li>
<li><a href="#org826e81b">5. <span class="todo TODO">TODO</span> Proposal Peer-Review (during class)</a></li>
<li><a href="#orgacc9bee">6. <span class="todo TODO">TODO</span> Proposal Peer-Review feedback reflection</a></li>
<li><a href="#org1d1e316">7. <span class="todo TODO">TODO</span> Final Submission of Project Proposal (On CULearn)</a></li>
<li><a href="#org8f54654">8. <span class="todo TODO">TODO</span> Individual Lab Exam (To be scheduled collaboratively with TAs)</a></li>
<li><a href="#org3e4675b">9. <span class="todo TODO">TODO</span> Synchronous Design Peer Review (Mandatory)</a></li>
<li><a href="#org8473878">10. <span class="todo TODO">TODO</span> Final Submission of Project Design (On CULearn)</a></li>
<li><a href="#org9dc5948">11. <span class="todo TODO">TODO</span> Lab Check-in (End-to-End Demo) (To be scheduled collaboratively with TAs)</a></li>
<li><a href="#org957e123">12. <span class="todo TODO">TODO</span> Lab Check-in (Testing Demo) (To be scheduled collaboratively with TAs)</a></li>
<li><a href="#orgcd05dff">13. <span class="todo TODO">TODO</span> Submission of Technical Memo</a></li>
<li><a href="#org94837d7">14. <span class="todo TODO">TODO</span> Synchronous Code Peer Review (Mandatory)</a></li>
<li><a href="#org1f835b6">15. <span class="todo TODO">TODO</span> Final Demo of Project (To be scheduled collaboratively with TAs)</a></li>
<li><a href="#org422d5d9">16. <span class="todo TODO">TODO</span> Final Project Report/Video with Synchronous Poster Fair</a></li>
</ul>
</div>
</div>
<div id="outline-container-org08b0850" class="outline-2">
<h2 id="org08b0850"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Get project group</h2>
<div class="outline-text-2" id="text-1">
<p>
Group: L3-T-2
Members:
</p>
<ul class="org-ul">
<li>Morgan Smith</li>
<li>Samuel Dewan</li>
<li>Mario Shebib</li>
<li>Sunjeevani Pujari</li>
</ul>
</div>
</div>
<div id="outline-container-org0c01f24" class="outline-2">
<h2 id="org0c01f24"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Team Contract Submission</h2>
<div class="outline-text-2" id="text-2">
</div>
</div>
<div id="outline-container-orgf57a3a8" class="outline-2">
<h2 id="orgf57a3a8"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> Approval of project concept</h2>
<div class="outline-text-2" id="text-3">
</div>
</div>
<div id="outline-container-org2f2b192" class="outline-2">
<h2 id="org2f2b192"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Proposal Draft</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
<div id="outline-container-org826e81b" class="outline-2">
<h2 id="org826e81b"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Proposal Peer-Review (during class)</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
<div id="outline-container-orgacc9bee" class="outline-2">
<h2 id="orgacc9bee"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Proposal Peer-Review feedback reflection</h2>
<div class="outline-text-2" id="text-6">
<p>
Opens <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-10-01 Thu 12:00&gt;</span></span>
</p>
</div>
</div>
<div id="outline-container-org1d1e316" class="outline-2">
<h2 id="org1d1e316"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Final Submission of Project Proposal (On CULearn)</h2>
<div class="outline-text-2" id="text-7">
</div>
</div>
<div id="outline-container-org8f54654" class="outline-2">
<h2 id="org8f54654"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> Individual Lab Exam (To be scheduled collaboratively with TAs)</h2>
<div class="outline-text-2" id="text-8">
</div>
</div>
<div id="outline-container-org3e4675b" class="outline-2">
<h2 id="org3e4675b"><span class="section-number-2">9</span> <span class="todo TODO">TODO</span> Synchronous Design Peer Review (Mandatory)</h2>
<div class="outline-text-2" id="text-9">
</div>
</div>
<div id="outline-container-org8473878" class="outline-2">
<h2 id="org8473878"><span class="section-number-2">10</span> <span class="todo TODO">TODO</span> Final Submission of Project Design (On CULearn)</h2>
<div class="outline-text-2" id="text-10">
</div>
</div>
<div id="outline-container-org9dc5948" class="outline-2">
<h2 id="org9dc5948"><span class="section-number-2">11</span> <span class="todo TODO">TODO</span> Lab Check-in (End-to-End Demo) (To be scheduled collaboratively with TAs)</h2>
<div class="outline-text-2" id="text-11">
</div>
</div>
<div id="outline-container-org957e123" class="outline-2">
<h2 id="org957e123"><span class="section-number-2">12</span> <span class="todo TODO">TODO</span> Lab Check-in (Testing Demo) (To be scheduled collaboratively with TAs)</h2>
<div class="outline-text-2" id="text-12">
</div>
</div>
<div id="outline-container-orgcd05dff" class="outline-2">
<h2 id="orgcd05dff"><span class="section-number-2">13</span> <span class="todo TODO">TODO</span> Submission of Technical Memo</h2>
<div class="outline-text-2" id="text-13">
</div>
</div>
<div id="outline-container-org94837d7" class="outline-2">
<h2 id="org94837d7"><span class="section-number-2">14</span> <span class="todo TODO">TODO</span> Synchronous Code Peer Review (Mandatory)</h2>
<div class="outline-text-2" id="text-14">
</div>
</div>
<div id="outline-container-org1f835b6" class="outline-2">
<h2 id="org1f835b6"><span class="section-number-2">15</span> <span class="todo TODO">TODO</span> Final Demo of Project (To be scheduled collaboratively with TAs)</h2>
<div class="outline-text-2" id="text-15">
</div>
</div>
<div id="outline-container-org422d5d9" class="outline-2">
<h2 id="org422d5d9"><span class="section-number-2">16</span> <span class="todo TODO">TODO</span> Final Project Report/Video with Synchronous Poster Fair</h2>
<div class="outline-text-2" id="text-16">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-09-27 Sun 20:06</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
